<?php

return [

    'default' => [
        'created' => 'تم إنشاء سجل :model',
        'updated' => 'تم تحديث سجل :model',
        'deleted' => 'تم حذف سجل :model',
    ],

    'models' => [
        'otp' => 'رمز التحقق',
        'team' => 'الفريق',
        'session' => 'الجلسة',
        'user' => 'حساب المستخدم',
        'login' => 'محاولة تسجيل الدخول',
        'forgot' => 'نسيت كلمة المرور',
        'reset' => 'إعادة تعيين كلمة المرور',
    ],

    'login' => [
        'success' => 'تم تسجيل الدخول بنجاح',
        'failed' => [
            'credentials' => 'فشل تسجيل الدخول: بيانات الاعتماد غير صحيحة',
            'inactive' => 'فشل تسجيل الدخول: الحساب غير مفعل',
        ],
        'exception' => 'فشل تسجيل الدخول بسبب خطأ غير متوقع',
    ],

    'otp' => [
        'success' => 'تم التحقق من الرمز بنجاح وتم تسجيل الدخول',
        'failed' => [
            'credentials' => 'فشل التحقق من الرمز: بيانات الاعتماد غير صحيحة',
            'inactive' => 'فشل التحقق من الرمز: الحساب غير مفعل',
            'expired' => 'فشل التحقق من الرمز: الرمز غير صالح أو منتهي الصلاحية',
        ],
        'exception' => 'فشل التحقق من الرمز بسبب خطأ غير متوقع',
    ],

    'forgot' => [
        'success' => 'تم إرسال رابط إعادة تعيين كلمة المرور إلى المستخدم',
        'failed' => [
            'validation' => 'فشل في استعادة كلمة المرور بسبب أخطاء في التحقق من البيانات',
        ],
        'exception' => 'فشل في استعادة كلمة المرور بسبب خطأ غير متوقع',
    ],

    'reset' => [
        'success' => 'تم إعادة تعيين كلمة المرور بنجاح',
        'failed' => 'فشلت عملية إعادة تعيين كلمة المرور',
        'failed_validation' => 'فشلت عملية إعادة تعيين كلمة المرور بسبب أخطاء في البيانات',
        'exception' => 'فشلت عملية إعادة تعيين كلمة المرور بسبب خطأ غير متوقع',
        'sent' => "تم إرسال بريد إلكتروني لإعادة تعيين كلمة المرور"
    ],

];
